app/controllers/plants_controller.rb

  def index
    if params[:todo_id]
      @todo = Todo.find(params[:todo_id])
      @plants = @todo.plants.all
---
SELECT "todos".* FROM "todos" WHERE "todos"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "plants".* FROM "plants"

  def show
    @plant = Plant.find(params[:id])
---
SELECT "plants".* FROM "plants" WHERE "plants"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]

  def create
    @plant = Plant.new(plant_params)
    @plant.todo_id=params[:todo_id]
    if @plant.save
---
INSERT INTO "plants" ("water", "fertilize", "prune", "repot", "notes", "img", "date", "created_at", "updated_at", "todo_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10) RETURNING "id"

  def update
    @plant = Plant.find(params[:id])
    if @plant.update(plant_params)
---
SELECT "plants".* FROM "plants" WHERE "plants"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
UPDATE "plants" SET "notes" = $1, "updated_at" = $2 WHERE "plants"."id" = $3  [["notes", "need to repot "], ["updated_at", "2021-10-27 20:07:50.827417"], ["id", 4]]