app/controllers/todos_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
SELECT "todos".* FROM "todos" WHERE "todos"."user_id" = $1  [["user_id", 1]]
SELECT "todos".* FROM "todos" WHERE (1)
---
    def index
        if params[:user_id]
            @user = User.find(params[:user_id])
            @todos = @user.todos.all
            render json: @todos
          else
            @todos = Todo.all

INSERT INTO "todos" ("title", "url", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
---
    def create
        @todo = Todo.new(todo_params)
        @todo.user_id = params[:user_id]
        if @todo.save

SELECT "todos".* FROM "todos" WHERE "todos"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "todos" SET "title" = $1, "updated_at" = $2 WHERE "todos"."id" = $3  [["title", "dfsadfdsfsadfasfd"], ["updated_at", "2025-02-03 12:24:51.783955"], ["id", 1]]
---
    def update
        @todo = Todo.find(params[:id])
        if @todo.update(todo_params)

DELETE FROM "todos" WHERE "todos"."id" = $1  [["id", 1]]
---
    def destroy
        @todo = Todo.destroy(params[:id])