app/controllers/todos_controller.rb

DELETE FROM "todos" WHERE "todos"."id" = $1  [["id", 9]]
---
    def destroy
        @todo = Todo.destroy(params[:id])