app/controllers/users_controller.rb

    def create
        @user = User.new(user_params)
        if @user.save
---
INSERT INTO "users" ("password_digest", "username", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"

    def destroy
        user = User.destroy(params[:id])
---
DELETE FROM "users" WHERE "users"."id" = $1  [["id", 7]]